toasterllc/MDCCode/Code/STM32/Shared/USB.h
    static void EndpointReset(uint8_t ep) {
        Toastbox::IntState ints(false);
        _EndpointReset(ep);
        
        T_Scheduler::Ctx(ep);
        T_Scheduler::Wait([] { return _EndpointReady(T_Scheduler::template Ctx<uint8_t>()); });
    }
    
    static void EndpointsReset() {
        Toastbox::IntState ints(false);
        for (uint8_t ep : T_Config::Endpoints) {
            _EndpointReset(ep);
        }
        T_Scheduler::Wait([] { return _EndpointsReady(); });
    }
    
    template <typename T>
    static void CmdRecv(T& cmd) {
        for (;;) {
            // Wait until we're in the Connecting state
            {
                Toastbox::IntState ints(false);
                T_Scheduler::Wait([] { return _State == State::Connecting || _State == State::Connected; });
                if (_State == State::Connecting) {
                    // Update our state
                    _State = State::Connected;
                    _CmdRecvLen = std::nullopt;
                }
            }
            
            // Wait for a command
            for (;;) {
                // Disable interrupts
                Toastbox::IntState ints(false);
                
                // Wait for a new command to arrive, or for our state to change
                T_Scheduler::Wait([] { return _CmdRecvLen || _State!=State::Connected; });
                
                // If we're no longer connected, bail and wait to be connected again
                if (_State != State::Connected) break;
                
                // Consume the command
                const size_t len = *_CmdRecvLen;
                _CmdRecvLen = std::nullopt;
                
                // Reject command if the length isn't valid
                if (len != sizeof(T)) {
                    _CmdAccept(false);
                    continue;
                }
                
                // Return command to caller
                memcpy(&cmd, _CmdRecvBuf, len);
                return;
            }
        }
    }
    
//    static void _WaitForConnect() {
//        T_Scheduler::Wait([] { return _State == State::Connected; });
//    }
    
    static void CmdAccept(bool accept) {
        Toastbox::IntState ints(false);
        // Short-circuit if we're not Connected
        if (_State != State::Connected) return;
        _CmdAccept(accept);
    }
    
//    static std::optional<size_t> _Recv(_EndpointState& eps, void* data, size_t len) {
//        const uint8_t epnum = _EndpointNum(eps);
//        
//        {
//            Toastbox::IntState ints(false);
//            if (_State != State::Connected) return std::nullopt; // Short-circuit if we're not Connected
//            
//            Assert(_Ready(eps));
//            _AdvanceStateOut(eps);
//            
//            USBD_StatusTypeDef us = USBD_LL_PrepareReceive(&_Device, epnum, (uint8_t*)data, len);
//            Assert(us == USBD_OK);
//        }
//        
//        auto waitResult = T_Scheduler::Wait([] { return _Wait(ep, outep); });
//        if (!waitResult.ok) return std::nullopt;
//        return waitResult.len;
//    }
//    
//    static std::optional<size_t> _RecvStart(uint8_t ep, void* data, size_t len) {
//        if (_State != State::Connected) return std::nullopt; // Short-circuit if we're not Connected
//        
//        Assert(_Ready(outep));
//        _AdvanceState(ep, outep);
//        
//        USBD_StatusTypeDef us = USBD_LL_PrepareReceive(&_Device, ep, (uint8_t*)data, len);
//        Assert(us == USBD_OK);
//        
//        {
//            Toastbox::IntState ints(false);
//            if (_State != State::Connected) return std::nullopt; // Short-circuit if we're not Connected
//            
//            Assert(_Ready(outep));
//            _AdvanceState(ep, outep);
//            
//            USBD_StatusTypeDef us = USBD_LL_PrepareReceive(&_Device, ep, (uint8_t*)data, len);
//            Assert(us == USBD_OK);
//        }
//        
//        auto waitResult = T_Scheduler::Wait([] { return _Wait(ep, outep); });
//        if (!waitResult.ok) return std::nullopt;
//        return waitResult.len;
//    }
    
    static std::optional<size_t> Recv(uint8_t ep, void* data, size_t len) {
        Assert(EndpointOut(ep));
        _EndpointState& eps = _EndpointStateGet(ep);
        
        Toastbox::IntState ints(false);
        if (_State != State::Connected) return std::nullopt; // Short-circuit if we're not Connected
        
        Assert(_Ready(eps));
        _AdvanceStateOut(ep);
        
        const USBD_StatusTypeDef us = USBD_LL_PrepareReceive(&_Device, ep, (uint8_t*)data, len);
        Assert(us == USBD_OK);
        
        _WaitState ws = { .ep = ep };
        T_Scheduler::Ctx(&ws); // Set current task's context, which we'll retrieve from the Wait() lambda
        T_Scheduler::Wait([] { return _WaitOut(*T_Scheduler::template Ctx<_WaitState*>()); });
        if (!ws.ok) return std::nullopt;
        return ws.len;
    }
    
    static bool Send(uint8_t ep, const void* data, size_t len) {
        Assert(EndpointIn(ep));
        _EndpointState& eps = _EndpointStateGet(ep);
        
        Toastbox::IntState ints(false);
        if (_State != State::Connected) return false; // Short-circuit if we're not Connected
        
        Assert(_Ready(eps));
        _AdvanceStateIn(ep);
        
        const USBD_StatusTypeDef us = USBD_LL_Transmit(&_Device, ep, (uint8_t*)data, len);
        Assert(us == USBD_OK);
        
        _WaitState ws = { .ep = ep };
        T_Scheduler::Ctx(&ws); // Set current task's context, which we'll retrieve from the Wait() lambda
        T_Scheduler::Wait([] { return _WaitIn(*T_Scheduler::template Ctx<_WaitState*>()); });
        return ws.ok;
    }
    
    static void ISR() {
        ISR_HAL_PCD(&_PCD);
    }
    
private:
    static uint8_t _USBD_Init(uint8_t cfgidx) {
        // Open endpoints
        for (uint8_t ep : T_Config::Endpoints) {
            if (EndpointOut(ep)) {
                USBD_LL_OpenEP(&_Device, ep, USBD_EP_TYPE_BULK, MaxPacketSizeOut());
                _Device.ep_out[EndpointIdx(ep)].is_used = 1U;
            
            } else {
                USBD_LL_OpenEP(&_Device, ep, USBD_EP_TYPE_BULK, MaxPacketSizeIn());
                _Device.ep_in[EndpointIdx(ep)].is_used = 1U;
            }
            
            // Reset endpoint state
            _EndpointStateGet(ep) = {};
        }
        
        _State = State::Connecting;
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_DeInit(uint8_t cfgidx) {
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_Suspend() {
        if (_State == State::Disconnected) return USBD_OK; // Short-circuit if we're already Disconnected
        
        Init();
        _State = State::Disconnected;
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_Resume() {
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_Setup(USBD_SetupReqTypedef* req) {
        switch (req->bmRequest & USB_REQ_TYPE_MASK) {
        case USB_REQ_TYPE_VENDOR:
            USBD_CtlPrepareRx(&_Device, _CmdRecvBuf, sizeof(_CmdRecvBuf));
            return USBD_OK;
        
        default:
            USBD_CtlError(&_Device, req);
            return USBD_FAIL;
        }
    }
    
    static uint8_t _USBD_EP0_TxSent() {
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_EP0_RxReady() {
        const size_t recvLen = USBD_LL_GetRxDataSize(&_Device, 0);
        if (!_CmdRecvLen) {
            _CmdRecvLen = recvLen;
        } else {
            // If a command is already underway, respond to the request with an error
            USBD_CtlError(&_Device, nullptr);
        }
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_DataIn(uint8_t ep) {
        // Sanity-check the endpoint state
        _EndpointState& eps = _EndpointStateGet(ep);
        Assert(
            eps.stage == _EndpointStage::ResetZLP1     ||
            eps.stage == _EndpointStage::ResetZLP2     ||
            eps.stage == _EndpointStage::ResetSentinel ||
            eps.stage == _EndpointStage::Busy
        );
        
        _AdvanceStateIn(ep);
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_DataOut(uint8_t ep) {
        // Sanity-check the endpoint state
        _EndpointState& eps = _EndpointStateGet(ep);
        Assert(
            eps.stage == _EndpointStage::ResetZLP1     ||
            eps.stage == _EndpointStage::ResetZLP2     ||
            eps.stage == _EndpointStage::ResetSentinel ||
            eps.stage == _EndpointStage::Busy
        );
        
