toasterllc/MDCCode/Code/STM32/Shared/USB.h
        _AdvanceStateOut(ep);
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_SOF() {
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_IsoINIncomplete(uint8_t ep) {
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_IsoOUTIncomplete(uint8_t ep) {
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t* _USBD_GetHSConfigDescriptor(uint16_t* len) {
        *len = sizeof(T_Config::Descriptor);
        return (uint8_t*)&T_Config::Descriptor;
    }
    
    static uint8_t* _USBD_GetFSConfigDescriptor(uint16_t* len) {
        return nullptr;
    }
    
    static uint8_t* _USBD_GetOtherSpeedConfigDescriptor(uint16_t* len) {
        return nullptr;
    }
    
    static uint8_t* _USBD_GetDeviceQualifierDescriptor(uint16_t* len) {
        return nullptr;
    }
    
    static uint8_t* _USBD_GetUsrStrDescriptor(uint8_t index, uint16_t* len) {
        return nullptr;
    }
    
    // Interrupts must be disabled
    static void _CmdAccept(bool accept) {
        if (accept) USBD_CtlSendStatus(&_Device);
        else        USBD_CtlError(&_Device, nullptr);
    }
    
//    static _EndpointState& _OutEndpointStateGet(uint8_t ep) {
//        if constexpr (EndpointCountOut()) {
//            return _OutEndpoints[EndpointIdx(ep)-1];
//        }
//        abort();
//    }
    
//    static const _EndpointState& _OutEndpointStateGet(uint8_t ep) {
//        if constexpr (EndpointCountOut()) {
//            return _OutEndpoints[EndpointIdx(ep)-1];
//        }
//        abort();
////        return const_cast<const _EndpointState&>(std::as_const(*this)._OutEndpointStateGet(ep));
//    }
    
//    static _InEndpoint& _EndpointStateGet(uint8_t ep) {
//        if constexpr (EndpointCountIn()) {
//            return _InEndpoints[EndpointIdx(ep)-1];
//        }
//        abort();
//    }
    
//    template <uint8_t T_Ep>
//    static bool _Wait() {
//        // Short-circuit if we're not Connected
//        if (_State != State::Connected) return true;
//        const _EndpointState& eps = _EndpointStateGet<T_Ep>();
//        switch (eps.stage) {
//        case _EndpointStage::Busy:  return false;   // Still waiting for completion
//        case _EndpointStage::Done:  return true;    // Done, success
//        default:                    return true;    // Done, failed
//        }
//    }
    
    struct _WaitState {
        const uint8_t ep = 0;
        bool ok = false;
        size_t len = 0;
    };
    
    static bool _WaitOut(_WaitState& ws) {
        // Short-circuit if we're not Connected
        if (_State != State::Connected) return true; // Done, failed
        
        const _EndpointState& eps = _EndpointStateGet(ws.ep);
        switch (eps.stage) {
        // Still waiting for completion
        case _EndpointStage::Busy:
            return false;
        // Done, success
        case _EndpointStage::Done:
            ws.ok = true;
            ws.len = eps.len;
            _AdvanceStateOut(ws.ep);
            return true;
        // Done, failed
        default:
            return true;
        }
    }
    
    static bool _WaitIn(_WaitState& ws) {
        // Short-circuit if we're not Connected
        if (_State != State::Connected) return true; // Done, failed
        
        const _EndpointState& eps = _EndpointStateGet(ws.ep);
        switch (eps.stage) {
        // Still waiting for completion
        case _EndpointStage::Busy:
            return false;
        // Done, success
        case _EndpointStage::Done:
            ws.ok = true;
            _AdvanceStateIn(ws.ep);
            return true;
        // Done, failed
        default:
            return true;
        }
    }
    
//    static const _InEndpoint& _InEndpointStateGet(uint8_t ep) {
//        if constexpr (EndpointCountIn()) {
//            return _InEndpoints[EndpointIdx(ep)-1];
//        }
//        abort();
////        return const_cast<const _InEndpoint&>(std::as_const(*this)._InEndpointStateGet(ep));
//    }
    
//    // Interrupts must be disabled
//    template <uint8_t T_Ep>
//    static void _EndpointReset() {
//        if (_State != State::Connected) return; // Short-circuit if we're not Connected
//        _EndpointState& eps = _EndpointStateGet<T_Ep>();
//        eps.needsReset = true;
//        if (_Ready(eps)) {
//            if constexpr (EndpointOut(ep)) {
//                _AdvanceStateOut(T_Ep);
//            } else {
//                _AdvanceStateIn(T_Ep);
//            }
//        }
//    }
    
    
    // Interrupts must be disabled
    static void _EndpointReset(uint8_t ep) {
        if (_State != State::Connected) return; // Short-circuit if we're not Connected
        _EndpointState& eps = _EndpointStateGet(ep);
        eps.needsReset = true;
        if (_Ready(eps)) {
            if (EndpointOut(ep)) {
                _AdvanceStateOut(ep);
            } else {
                _AdvanceStateIn(ep);
            }
        }
    }
    
//    // Interrupts must be disabled
//    template <uint8_t T_Ep>
//    static void _EndpointReset() {
//        if constexpr (EndpointOut(T_Ep)) _OutEndpointReset(T_Ep);
//        else                             _InEndpointReset(T_Ep);
//    }
    
//    static void _OutEndpointReset(uint8_t ep) {
//        if (_State != State::Connected) return; // Short-circuit if we're not Connected
//        _EndpointState& eps = _OutEndpointStateGet(ep);
//        eps.needsReset = true;
//        if (_Ready(eps)) _AdvanceStateOut(ep);
//    }
//    
//    static void _InEndpointReset(uint8_t ep) {
//        if (_State != State::Connected) return; // Short-circuit if we're not Connected
//        _EndpointState& eps = _InEndpointStateGet(ep);
//        eps.needsReset = true;
//        if (_Ready(eps)) _AdvanceStateIn(ep);
//    }
    
    
    
    
//    // Interrupts must be disabled
//    template <uint8_t T_Ep>
//    static bool _EndpointReady() {
//        return _Ready(_EndpointStateGet<T_Ep>());
//    }
    
    
//    // Interrupts must be disabled
//    template <uint8_t T_Ep>
//    static void _OutEndpointReset() {
//        if (_State != State::Connected) return; // Short-circuit if we're not Connected
//        _EndpointState& eps = _OutEndpointStateGet<T_Ep>();
//        eps.needsReset = true;
//        if (_Ready(eps)) _AdvanceStateOut(T_Ep);
//    }
//    
//    // Interrupts must be disabled
//    template <uint8_t T_Ep>
//    static void _InEndpointReset() {
//        if (_State != State::Connected) return; // Short-circuit if we're not Connected
//        _EndpointState& eps = _InEndpointStateGet<T_Ep>();
//        eps.needsReset = true;
//        if (_Ready(eps)) _AdvanceStateIn(T_Ep);
//    }
//    
//    // Interrupts must be disabled
//    template <uint8_t T_Ep>
//    static bool _OutEndpointReady() {
//        return _Ready(_OutEndpointStateGet<T_Ep>());
//    }
//    
//    // Interrupts must be disabled
//    template <uint8_t T_Ep>
//    static bool _InEndpointReady() {
//        return _Ready(_InEndpointStateGet<T_Ep>());
//    }
    
    
    
//    // Interrupts must be disabled
//    static void _EndpointReset(uint8_t ep) {
//        if (_State != State::Connected) return; // Short-circuit if we're not Connected
//        
//        if (EndpointOut(ep)) {
//            _EndpointState& outep = _OutEndpointStateGet(ep);
//            if (_Ready(outep))  _EndpointReset(ep, outep);
//            else                outep.needsReset = true;
//        
//        } else {
//            _InEndpoint& inep = _InEndpointStateGet(ep);
//            if (_Ready(inep))   _EndpointReset(ep, inep);
//            else                inep.needsReset = true;
//        }
//    }
    
//    // Interrupts must be disabled
//    static bool _EndpointReady(uint8_t ep) {
//        if (EndpointOut(ep))    return _Ready(_OutEndpointStateGet(ep));
//        else                    return _Ready(_InEndpointStateGet(ep));
//    }
    
