toasterllc/MDCCode/Code/STM32/Shared/USB.h
    static bool _EndpointReady(uint8_t ep) {
        return _Ready(_EndpointStateGet(ep));
    }
    
    // Interrupts must be disabled
    static bool _EndpointsReady() {
        for (uint8_t ep : T_Config::Endpoints) {
            if (!_EndpointReady(ep)) return false;
//            _EndpointState& eps = _EndpointStateGet(ep);
//            if (!_Ready(eps)) return false;
        }
        return true;
    }
    
//    // Interrupts must be disabled
    static bool _Ready(const _EndpointState& eps)   { return eps.stage==_EndpointStage::Ready;  }
//    static bool _Busy(const _EndpointState& eps)    { return eps.stage==_EndpointStage::Busy;   }
//    static bool _Done(const _EndpointState& eps)    { return eps.stage==_EndpointStage::Done;   }
    
//    // Interrupts must be disabled
//    static void _EndpointReset(_EndpointState& eps) {
//        eps.stage = _EndpointStage::Reset;
//        eps.needsReset = false;
//        _AdvanceState(ep, eps);
//    }
    
    // Interrupts must be disabled
    static void _AdvanceStateOut(uint8_t ep) {
        _EndpointState& eps = _EndpointStateGet(ep);
        if (eps.needsReset) {
            eps.stage = _EndpointStage::Reset;
            eps.needsReset = false;
        }
        
        eps.len = USBD_LL_GetRxDataSize(&_Device, ep);
        
        // State transitions
        switch (eps.stage) {
        case _EndpointStage::Ready:     eps.stage = _EndpointStage::Busy; break;
        case _EndpointStage::Busy:      eps.stage = _EndpointStage::Done; break;
        case _EndpointStage::Done:      eps.stage = _EndpointStage::Ready; break;
        case _EndpointStage::Reset:     eps.stage = _EndpointStage::ResetZLP1; break;
        case _EndpointStage::ResetZLP1:
            // Only advance if we received a ZLP
            if (eps.len == 0) eps.stage = _EndpointStage::ResetSentinel;
            break;
        case _EndpointStage::ResetSentinel:
            // Only advance if we received the sentinel
            if (eps.len == sizeof(_ResetSentinel)) eps.stage = _EndpointStage::Ready;
            break;
        default:
            abort();
        }
        
        // State actions
        switch (eps.stage) {
        case _EndpointStage::ResetZLP1:
        case _EndpointStage::ResetSentinel:
            USBD_LL_PrepareReceive(&_Device, ep, (uint8_t*)_DevNullAddr, MaxPacketSizeBulk);
            break;
        default:
            break;
        }
    }
    
    // Interrupts must be disabled
    static void _AdvanceStateIn(uint8_t ep) {
        _EndpointState& eps = _EndpointStateGet(ep);
        if (eps.needsReset) {
            eps.stage = _EndpointStage::Reset;
            eps.needsReset = false;
        }
        
        // We send two ZLPs (instead of just one) because if a transfer is in progress, the first ZLP will
        // get 'eaten' as a ZLP that terminates the existing transfer. So to guarantee that the reader
        // actually gets a ZLP, we have to send two.
        // After sending the two ZLPs, we also send a sentinel to account for the fact that we don't know
        // how many ZLPs that the reader will receive, because we don't know if the first ZLP will
        // necessarily terminate a transfer (because a transfer may not have been in progress, or if a
        // transfer was in progress, it may have sent exactly the number of bytes that the reader
        // requested, in which case no ZLP is needed to end the transfer). By using a sentinel, the
        // reader knows that no further ZLPs will be received after the sentinel has been received, and
        // therefore the endpoint is finished being reset.
        
        // State transitions
        switch (eps.stage) {
        case _EndpointStage::Ready:         eps.stage = _EndpointStage::Busy;          break;
        case _EndpointStage::Busy:          eps.stage = _EndpointStage::Done;          break;
        case _EndpointStage::Done:          eps.stage = _EndpointStage::Ready;         break;
        case _EndpointStage::Reset:         eps.stage = _EndpointStage::ResetZLP1;     break;
        case _EndpointStage::ResetZLP1:     eps.stage = _EndpointStage::ResetZLP2;     break;
        case _EndpointStage::ResetZLP2:     eps.stage = _EndpointStage::ResetSentinel; break;
        case _EndpointStage::ResetSentinel: eps.stage = _EndpointStage::Ready;         break;
        default:                            abort();
        }
        
        // State actions
        switch (eps.stage) {
        case _EndpointStage::ResetZLP1:
        case _EndpointStage::ResetZLP2:
            USBD_LL_TransmitZeroLen(&_Device, ep);
            break;
        case _EndpointStage::ResetSentinel:
            USBD_LL_Transmit(&_Device, ep, (uint8_t*)&_ResetSentinel, sizeof(_ResetSentinel));
            break;
        default:
            break;
        }
    }
    
//    template <uint8_t T_Ep>
//    static constexpr _EndpointState& _OutEndpointStateGet() {
//        static_assert(EndpointOut(T_Ep), "must be OUT endpoint");
//        return _OutEndpoints[EndpointIdx(T_Ep)-1];
//    }
    
//    static constexpr _EndpointState& _OutEndpointStateGet(uint8_t ep) {
//        return _OutEndpoints[EndpointIdx(ep)-1];
//    }
    
//    template <uint8_t T_Ep>
//    static constexpr _EndpointState& _InEndpointStateGet() {
//        static_assert(EndpointIn(T_Ep), "must be IN endpoint");
//        return _InEndpoints[EndpointIdx(T_Ep)-1];
//    }
    
//    static constexpr _EndpointState& _InEndpointStateGet(uint8_t ep) {
//        return _InEndpoints[EndpointIdx(ep)-1];
//    }
    
//    template <uint8_t T_Ep>
//    static constexpr _EndpointState& _EndpointStateGet() {
//        if constexpr (EndpointOut(T_Ep)) {
//            return _OutEndpoints[EndpointIdx(T_Ep)-1];
//        } else {
//            return _InEndpoints[EndpointIdx(T_Ep)-1];
//        }
//        
//    }
    
    static _EndpointState& _EndpointStateGet(uint8_t ep) {
        if (EndpointOut(ep)) {
            return _OutEndpoints[EndpointIdx(ep)-1];
        } else {
            return _InEndpoints[EndpointIdx(ep)-1];
        }
    }
    
