toasterllc/MDCCode/Code/STM32/Shared/USB.h
//    template <uint8_t T_Ep>
//    static constexpr _EndpointState& _EndpointStateGet() {
//        if constexpr (EndpointIn(T_Ep)) {
//            return _InEndpoints[EndpointIdx(T_Ep)-1];
//        }
//        return _OutEndpoints[EndpointIdx(T_Ep)-1];
//    }
//    
//    static bool _EndpointOut(_EndpointState& eps) {
//        return &eps>=std::begin(_OutEndpoints) && &eps<std::end(_OutEndpoints);
//    }
//    
//    static bool _EndpointIn(_EndpointState& eps) {
//        return &eps>=std::begin(_InEndpoints) && &eps<std::end(_InEndpoints);
//    }
//    
//    static uint8_t _EndpointNum(_EndpointState& eps) {
//        if (_EndpointOut(eps)) {
//            return Toastbox::USB::Endpoint::DirectionOut | (uint8_t)(&eps-_OutEndpoints);
//        }
//        return Toastbox::USB::Endpoint::DirectionIn | (uint8_t)(&eps-_InEndpoints);
//    }
//    
//    static uint8_t _EndpointNumIn(_EndpointState& eps) {
//        return Toastbox::USB::Endpoint::DirectionIn | (uint8_t)(&eps-_InEndpoints);
//    }
//    
//    static uint8_t _EndpointNumOut(_EndpointState& eps) {
//        return Toastbox::USB::Endpoint::DirectionOut | (uint8_t)(&eps-_OutEndpoints);
//    }
    
private:
    alignas(4)
    static const inline uint8_t _ResetSentinel = 0; // Aligned to send via USB
    
    // _DevNullAddr: address that throw-away data can be written to.
    // This must be a region that a packet can be written to without causing
    // side-effects. We don't want to reserve actual RAM for this because it'd
    // just be wasted.
    // We're currently using the flash base address, so that the writes will be
    // ignored as long as the flash isn't unlocked.
    static constexpr uint32_t _DevNullAddr = 0x08000000;
    
    alignas(4)
    static inline uint8_t _CmdRecvBuf[MaxPacketSizeCtrl]; // Aligned to receive via USB
    
    static inline std::optional<size_t> _CmdRecvLen;
    static inline _EndpointState _OutEndpoints[EndpointCountOut()] = {};
    static inline _EndpointState _InEndpoints[EndpointCountIn()] = {};
    static inline USBD_HandleTypeDef _Device;
    static inline PCD_HandleTypeDef _PCD;
    static inline State _State = State::Disconnected;
};
